def creating_schedule_in_str(schedule: dict, week: str) -> str:
    schedule_str = ''
    for one_day in schedule:
        day = one_day['day']
        lessons = one_day['lessons']

        lessons_str = '-------------------------------------------\n'
        for lesson in lessons:
            name = lesson['name']
            time = lesson['time']
            lesson_week = lesson['week']

            if lesson_week != week and lesson_week != 'all':
                continue

            if name == 'свободно':
                lessons_str += f'{time}\n' \
                               f'{name}'

            else:
                aud = lesson['aud']
                if aud:
                    aud = f'Аудитория: {aud}\n'
                time = lesson['time']
                info = lesson['info']
                prep = lesson['prep']

                lessons_str += f'{time}\n' \
                               f'{aud}' \
                               f'{name}\n' \
                               f'{info} {prep}' \

            lessons_str += '\n-------------------------------------------\n'

        schedule_str += f'\n<b>{day}</b>\n' \
                        f'{lessons_str}'
        # schedule_str += '\n============================\n'

    return schedule_str


if __name__ == '__main__':
    schedule = [{'day': 'понедельник, 14 сентября ',
                 'lessons': [{'aud': '',
                              'info': '( Практ.,  )',
                              'name': 'Элективные курсы по физической культуре и спорту',
                              'prep': '',
                              'time': '8:15',
                              'week': 'even'},
                             {'aud': 'Ж309',
                              'info': '( Практ.,  )',
                              'name': 'Документоведение',
                              'prep': 'Иванов Н.А.',
                              'time': '8:15',
                              'week': 'odd'},
                             {'aud': 'ДАМФа',
                              'info': '( Практ.,  )',
                              'name': 'Цифровая обработка сигналов',
                              'prep': 'Дмитриев А. А.',
                              'time': '10:00',
                              'week': 'even'},
                             {'aud': 'Ж317',
                              'info': '( Практ.,  )',
                              'name': 'Теория информации',
                              'prep': 'Афанасьева Ж.С.',
                              'time': '10:00',
                              'week': 'odd'},
                             {'aud': 'И305',
                              'info': '( Лекция,  )',
                              'name': 'Математическая логика и теория алгоритмов',
                              'prep': 'Богданов А.И.',
                              'time': '11:45',
                              'week': 'all'},
                             {'aud': 'Ж309',
                              'info': '( Практ.,  )',
                              'name': 'Теория принятия решений',
                              'prep': 'Маринов А.А.',
                              'time': '13:45',
                              'week': 'all'},
                             {'aud': 'онлайн',
                              'info': '( Лекция,  )',
                              'name': 'Теория информации',
                              'prep': 'Афанасьев А.Д.',
                              'time': '17:10',
                              'week': 'even'},
                             {'aud': 'онлайн',
                              'info': '( Лекция,  )',
                              'name': 'Теория информации',
                              'prep': 'Афанасьев А.Д.',
                              'time': '17:10',
                              'week': 'odd'},
                             {'aud': 'онлайн',
                              'info': '( Практ., подгруппа 1 )',
                              'name': 'Иностранный язык в сфере профессиональной коммуникации',
                              'prep': '',
                              'time': '18:45',
                              'week': 'all'},
                             {'aud': 'онлайн',
                              'info': '( Практ., подгруппа 2 )',
                              'name': 'Иностранный язык в сфере профессиональной коммуникации',
                              'prep': '',
                              'time': '18:45',
                              'week': 'all'}]},
                {'day': 'среда, 16 сентября ',
                 'lessons': [{'aud': 'Ж313',
                              'info': '( Лаб. раб., подгруппа 1 )',
                              'name': 'Математические основы криптологии',
                              'prep': 'Тюрнев А.С.',
                              'time': '8:15',
                              'week': 'all'},
                             {'aud': 'ДАМФа',
                              'info': '( Лаб. раб., подгруппа 2 )',
                              'name': 'Цифровая обработка сигналов',
                              'prep': 'Дмитриев А. А.',
                              'time': '8:15',
                              'week': 'all'},
                             {'aud': 'ДАМФа',
                              'info': '( Лаб. раб., подгруппа 1 )',
                              'name': 'Цифровая обработка сигналов',
                              'prep': 'Дмитриев А. А.',
                              'time': '10:00',
                              'week': 'all'},
                             {'aud': 'Ж313',
                              'info': '( Лаб. раб., подгруппа 2 )',
                              'name': 'Математические основы криптологии',
                              'prep': 'Тюрнев А.С.',
                              'time': '10:00',
                              'week': 'all'},
                             {'aud': '',
                              'info': '( Практ.,  )',
                              'name': 'Элективные курсы по физической культуре и спорту',
                              'prep': '',
                              'time': '11:45',
                              'week': 'even'},
                             {'aud': '',
                              'info': '( Практ.,  )',
                              'name': 'Элективные курсы по физической культуре и спорту',
                              'prep': '',
                              'time': '11:45',
                              'week': 'odd'},
                             {'aud': 'И305',
                              'info': '( Лекция,  )',
                              'name': 'Теория принятия решений',
                              'prep': 'Маринов А.А.',
                              'time': '13:45',
                              'week': 'all'}]},
                {'day': 'четверг, 17 сентября ',
                 'lessons': [{'aud': 'И305',
                              'info': '( Лекция,  )',
                              'name': 'Документоведение',
                              'prep': 'Иванов Н.А.',
                              'time': '8:15',
                              'week': 'even'},
                             {'aud': 'Дамф.',
                              'info': '( Лекция,  )',
                              'name': 'Цифровая обработка сигналов',
                              'prep': 'Дмитриев А. А.',
                              'time': '8:15',
                              'week': 'odd'},
                             {'aud': 'И305',
                              'info': '( Практ.,  )',
                              'name': 'Математическая логика и теория алгоритмов',
                              'prep': 'Богданов А.И.',
                              'time': '10:00',
                              'week': 'all'},
                             {'aud': 'Ж317',
                              'info': '( Лекция,  )',
                              'name': 'Математические основы криптологии',
                              'prep': 'Тюрнев А.С.',
                              'time': '11:45',
                              'week': 'all'},
                             {'aud': 'Ж309',
                              'info': '( Практ.,  )',
                              'name': 'Математические основы криптологии',
                              'prep': 'Тюрнев А.С.',
                              'time': '13:45',
                              'week': 'all'}]},
                {'day': 'пятница, 18 сентября ',
                 'lessons': [{'aud': 'К313',
                              'info': '( Практ.,  )',
                              'name': 'Документоведение',
                              'prep': 'Иванов Н.А.',
                              'time': '8:15',
                              'week': 'even'},
                             {'name': 'свободно', 'time': '8:15', 'week': 'odd'},
                             {'aud': 'К305',
                              'info': '( Лекция,  )',
                              'name': 'Защита персональных данных (факультатив)',
                              'prep': 'Иванов Н.А.',
                              'time': '10:00',
                              'week': 'even'},
                             {'name': 'свободно', 'time': '10:00', 'week': 'odd'},
                             {'aud': 'Ж317',
                              'info': '( Практ.,  )',
                              'name': 'Защита персональных данных (факультатив)',
                              'prep': 'Иванов Н.А.',
                              'time': '11:45',
                              'week': 'even'},
                             {'name': 'свободно', 'time': '11:45', 'week': 'odd'}]}]

    print(creating_schedule_in_str(schedule=schedule, week='odd'))
