error_messages = {
    'registration_not_finished': 'Я вас не понимаю\n'
                                 'Похоже, Вы не завершили регистрацию',
    'wrong_command': 'Я вас не понимаю\n'
                     'Для вызова подсказки используйте команду [Подсказка]\n'
                     'Для просмотра списка команд используйте команду [Помощь]'
}
registration_messages = {
    'new_registration': 'Для начала пройдите небольшую регистрацию\n'
                        'Кем вы являетесь?',
    'repeat_registration': 'Пройдите повторную регистрацию\n'
                           'Кем вы являетесь?'
}
